#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
aws_security_group.sg: Refreshing state... [id=sg-0e755be90fb152a4b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_security_group.sg must be replaced
-/+ resource "aws_security_group" "sg" {
      ~ arn                    = "arn:aws:ec2:us-east-1:993518793550:security-group/sg-0e755be90fb152a4b" -> (known after apply)
      ~ id                     = "sg-0e755be90fb152a4b" -> (known after apply)
      ~ name                   = "bastion-host-sg" -> "aws-bastion-host-sg" # forces replacement
      + name_prefix            = (known after apply)
      ~ owner_id               = "993518793550" -> (known after apply)
        tags                   = {
            "Name" = "Bastion-host-SG-SSH"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ sg_id = "sg-0e755be90fb152a4b" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

Results for commit: 8452e63461b703f909d16b6cc8cb2e34b6b621d7

*Pusher: @pavelbmth, Action: `pull_request`, Working Directory: `aws/networking/sg`, Workflow: `Terraform CI/CD`*